//
//  AppFeaturesList.swift
//  AGPU
//
//  Created by Марк Киричко on 22.07.2023.
//

import Foundation

struct AppFeaturesList {
    
    static let features = [
        
        AppFeatureModel(
            id: 1,
            name: "Dynamic Button",
            description: "Dynamic Button (Динамическая кнопка) - автоматически изменяет изображение на кнопке в зависимости от ваших действий."
        ),
        
        AppFeatureModel(
            id: 2,
            name: "Voice Control",
            description: "Voice Control (Голосовое управление) - просто используйте свой голос, чтобы открыть нужные разделы на сайте, найти конкретный корпус на карте или даже открыть случайный раздел сайта."
        ),
        
        AppFeatureModel(
            id: 3,
            name: "Find ASPU",
            description: "Find ASPU (Найти АГПУ) - простой и удобный способ быстрого поиска всех корпусов на карте. С помощью этой функции вы с легкостью найдете все необходимые корпуса, отображенные на карте в удобном интерфейсе."
        ),
        
        AppFeatureModel(
            id: 4,
            name: "Shake To Recall",
            description: "Shake To Recall (Встряхните чтобы вспомнить) - функция, которая позволяет мгновенно вернуться к последней веб-странице, которую вы читали. Просто потрясите ваше устройство, и она автоматически откроется, прокрутка будет на место, на котором вы остановились. Вы также сможете увидеть время последнего посещения этой страницы. Это удобно, быстро и точно по времени. Кроме того, вы также можете открыть недавний документ или посмотреть недавнее видео."
        ),
        
        AppFeatureModel(
            id: 5,
            name: "Selected Faculty",
            description: "Selected Faculty (Выбранный факультет) - выберите свой факультет, чтобы получать самые свежие новости, связанные именно с ним. Также, выберите свою группу, чтобы быстро получать актуальное расписание, специально для нее. И не забудьте выбрать кафедру, чтобы получать доступ к полезным методическим материалам."
        ),
        
        AppFeatureModel(
            id: 6,
            name: "Adaptive News",
            description: "Adaptive News (Адаптивные новости) - новости адаптируются в зависимости от выбранного факультета. При выборе факультета, вы получаете релевантные новости, связанные с вашим факультетом. А при отмене выбранного факультета, вы продолжите получать новости университета в целом."
        ),
        
        AppFeatureModel(
            id: 7,
            name: "ASPU Wallpapers",
            description: "ASPU Wallpapers (АГПУ обои) - вы можете скачать и установить обои связанные с АГПУ на экран вашего устройства."
        ),
        
        AppFeatureModel(
            id: 8,
            name: "Your Status",
            description: "Your Status (Ваш статус) - выберите свой статус в настройках и раскройте уникальный контент, приспособленный под ваш выбор."
        ),
        
        AppFeatureModel(
            id: 9,
            name: "Advanced Timetable",
            description: "Advanced Timetable (Продвинутое расписание) - функция, позволяющая получить расписание на основе выбранной группы. Она позволяет выбрать неделю из списка, автоматически прокрутиться до нужной недели, дня недели и группы, а также предоставляет информацию о том, в каком корпусе будут проходить занятия. Кроме того, вы можете отфильтровать пары по типу, чтобы быстро и удобно получить доступ к интересующим вас занятиям. Также вы можете поделиться расписанием на день или неделю в виде изображения."
        ),
        
        AppFeatureModel(
            id: 10,
            name: "Smart Calendar",
            description: "Smart Calendar (Умный календарь) - инновационная функция, которая при выборе даты в расписании показывает наличие пар, их количество и указывает на особые дни. Это помогает быстро организовать время и быть в курсе изменений в расписании."
        ),
        
        AppFeatureModel(
            id: 11,
            name: "Personalized App Icons",
            description: "Personalized App Icons (персональные иконки приложения) - функция, позволяющая вам установить иконку для приложения, а также выбрать иконку, которая соответствует вашему факультету."
        )
    ]
}
