//
//  AGPUGroups.swift
//  AGPU
//
//  Created by Марк Киричко on 12.07.2023.
//

import Foundation

struct AGPUGroups {
    static let groups = [
        "ВМ-ИВТ-1-1",
        "ВМ-ИВТ-2-1",
        "ВМ-ИВТ-3-1",
        "ВМ-ИВТ-4-1",
        "ВМ-Мат-1-1",
        "ВМ-Мат-2-1",
        "ВМ-Мат-3-1",
        "ВМ-Мат-4-1",
        "ВМ-МиЭк-1-1",
        "ВМ-МиЭк-2-1",
        "ВМ-МиЭк-3-1",
        "ВМ-ПИЭ-2-1",
        "ВМ-ФизИ-1-1",
        "ВМ-ФизИ-2-1",
        "ВМ-ФизИ-3-1",
        "ВМ-ФизИ-4-1",
        "ВМ-ФизИ-5-1",
        "ММ-МатИ-1-1",
        "ММ-МатИ-2-1",
        "ММ-ЦвО-1-1"
    ]
}
