//
//  AppFeaturesList.swift
//  AGPU
//
//  Created by Марк Киричко on 22.07.2023.
//

import Foundation

struct AppFeaturesList {
    
    static let features = [
        
        AppFeatureModel(
            name: "Dynamic Button",
            description: "Dynamic Button - Позвольте кнопке оживиться! Наша функция Dynamic Button позволяет автоматически менять изображение на кнопке в зависимости от ваших действий в приложении. Не нужно вручную обновлять изображение или создавать несколько кнопок - Dynamic Button самостоятельно адаптируется, чтобы отражать текущее состояние или действие, выполненное вами в приложении. Наслаждайтесь динамическим и умным пользовательским интерфейсом с помощью Dynamic Button."
        ),
        
        AppFeatureModel(
            name: "Voice Control",
            description: "Voice Control - Отправьте ваши действия на новый уровень с помощью функции Voice Control. Просто используйте свой голос, чтобы открыть нужную страницу на сайте, прокрутить до раздела или прокрутить саму веб-страницу. Распознавание речи позволяет вам управлять интерфейсом нашего приложения с легкостью и комфортом. Никаких жестов или нажатий кнопок, просто говорите, и приложение выполнит желаемые действия."
        ),
        
        AppFeatureModel(
            name: "Find AGPU",
            description: "Find AGPU - Откройте для себя удобную фишку Find AGPU, которая поможет вам быстро найти нужный вам корпус на карте. Просто выберите желаемый корпус из списка, и Find AGPU покажет его местоположение в удобном интерфейсе. Вы также можете проложить оптимальный маршрут до выбранного корпуса и начать свой путь к знаниям."
        ),
        
        AppFeatureModel(
            name: "Shake To Recall",
            description: "Shake To Recall - при тряске устройства открывается последняя веб-страница, которую вы читали. Автоматически прокручивает страницу до того места, на котором вы остановились в прошлый раз, и отображает время, когда вы последний раз пользовались этой страницей. Никаких лишних действий - просто трясите устройство, чтобы мгновенно возвращаться к своим недавним чтениям и продолжать с того момента, где остановились. Удобно, быстро и точно по времени. Shake To Recall - это уникальная функция, доступная в нашем приложении!"
        ),
        
        AppFeatureModel(
            name: "Elected Faculty",
            description: "Elected Faculty - Выберите свой факультет, чтобы получать самые свежие новости, связанные именно с ним. Также, выберите свою группу, чтобы быстро получать актуальное расписание, специально для нее. И не забудьте выбрать кафедру, чтобы получать доступ к полезным методическим материалам."
        ),
        
        AppFeatureModel(
            name: "AGPU Wallpapers",
            description: "AGPU Wallpapers - Вы можете скачать и установить обои связанные с АГПУ на экран вашего устройства."
        ),
        
        AppFeatureModel(
            name: "Your Status",
            description: "Your Status - Выберите свой статус в настройках и раскройте уникальный контент, приспособленный под ваш выбор."
        ),
    ]
}
