//
//  AGPUGroups.swift
//  AGPU
//
//  Created by Марк Киричко on 12.07.2023.
//

import Foundation

struct AGPUGroups {
    static let groups = [
        // ИПИМиФ заочная форма обучения
        "ZВМ-Мат-1-1",
        "ZВМ-Мат-2-1",
        "ZВМ-Мат-3-1",
        "ZВМ-Мат-4-1",
        "ZВМ-Мат-5-1",
        "ZВМ-ПИЭ-1-1",
        "ZВМ-ПИЭ-1-2",
        "ZВМ-ПИЭ-3-1",
        "ZВМ-ПИЭ-4-1",
        "ZВМ-ФизИ-1-1",
        "ZВМ-ФизИ-2-1",
        "ZВМ-ФизИ-3-1",
        "ZВМ-ФизИ-4-1",
        "ZВМ-ФизИ-5-1",
        "ZВМ-ФизИ-6-1",
        "ZВМ-ПИЭ-2-1",
        "ZММ-ЦвО-2-1",
        "ZSВМ-ПИЭ-1-1",
        "ZSВМ-ПИЭ-2-1",
        "ZSВМ-ПИЭ-3-1",
        "ZSВМ-ПИЭ-4-1",
        "ZММ-Астр-1-1",
        "ZММ-Астр-2-1",
        "ZММ-Астр-3-1",
        "ZММ-МатИ-1-1",
        "ZММ-МатИ-2-1",
        "ZММ-МатИ-3-1",
        // ИПИМиФ очная форма обучения
        "ВМ-ИВТ-1-1",
        "ВМ-ИВТ-2-1",
        "ВМ-ИВТ-3-1",
        "ВМ-ИВТ-4-1",
        "ВМ-Мат-1-1",
        "ВМ-Мат-2-1",
        "ВМ-Мат-3-1",
        "ВМ-Мат-4-1",
        "ВМ-МиЭк-1-1",
        "ВМ-МиЭк-2-1",
        "ВМ-МиЭк-3-1",
        "ВМ-ПИЭ-2-1",
        "ВМ-ФизИ-1-1",
        "ВМ-ФизИ-2-1",
        "ВМ-ФизИ-3-1",
        "ВМ-ФизИ-4-1",
        "ВМ-ФизИ-5-1",
        "ММ-МатИ-1-1",
        "ММ-МатИ-2-1",
        "ММ-ЦвО-1-1"
    ]
}
